package com.rdc.constant;


import com.rdc.rdcwelcome.R;

public class Content {
    public static final int[] COLOR = {
            R.color.rdc,
            R.color.java,
            R.color.web,
            R.color.android,
            R.color.data
    };
    public static final int[] COLOR_TITLE = {
            R.color.rdc_title,
            R.color.java_title,
            R.color.web_title,
            R.color.android_title,
            R.color.data_title
    };

    public static final String[] NAME = {"RDC 研发中心","Java 后台", "Web 前端", "Android 移动", "BigData 大数据"};
    public static final String[] SUMMARY = {"     主要进行Java后台服务器开发如JavaWeb 应用服务器的开发和维护。", "     基于HTML/CSS/JS开发，专注于网站界面以及提供更好的视觉冲击和用户体验。"
            , "     主要专注基于Java 语言的App 开发与Android 前沿技术的专研与发展。", "     致力于" +
            "挖掘数据、分析数据。既专注于基础，" +
            "又落实于项目；既沉浸于原理，又回归到兴趣。", "     2001年，研发中心成立" +
            "至今已经18年历史," +
            "是计算机学院一个最为老牌的团队。"};

    public static final int[] IMG = {
            R.drawable.rdc_small,
            R.drawable.java_big,
            R.drawable.web_big,
            R.drawable.android_big,
            R.drawable.big_data
    };


    public static final String[] CONTENT = {

            "      2001年,研发中心成立," +
                    "至今已经18年历史," +
                    "是计算机学院的一个老牌团队。\n\n" +
                    "      这么多年来," +
                    "团队成员一直致力于互联网、安卓手机应用" +
                    "数据库以及图形图像等技术的学习和开发。" +
                    "我们在基本专业课程和技能训练的基础上," +
                    "通过项目过程的进一步学习," +
                    "提高自身解决问题的能力、" +
                    "学习能力以及团队协作能力。\n\n" +
                    "      团队已有大批师兄师姐进入了百度、腾讯、" +
                    "华为、网易、阿里巴巴、金山等公司进行工作" +
                    "这里有优秀的学习榜样、丰富的学习资源" +
                    "良好的学习氛围、珍贵的项目经验," +
                    "还有活跃愉快的相处气氛。\n\n" +
                    "      如果你有出色的学习能力、" +
                    "对知识有近乎渴望的追求" +
                    "以及良好的抗压力和团队协作力" +
                    "那就加入我们吧!\n\n" +
                    "      在这里和你的队友们" +
                    "起打造属于你们的BAT之路!",


            "      Java后台开发" +
                    "小组一直致力于JavaWeb开发,专注" +
                    "于各种前沿的Java技术学习和实践能力的结合," +
                    "主要任务是进行业务逻辑的处理和与数据库、服" +
                    "务器等的交互。\n\n" +
                    "      我们在网络建设、网络改版、数据处理,数据" +
                    "交互等方面都积累了自己独特的经验并取得了良" +
                    "好的成绩。\n\n" +
                    "      后台开发与各小组相辅相成,无论是安卓端还" +
                    "是网页端,都需要后台技术的支持,只有和服务" +
                    "器进行沟通,才能成为一个完整的产品。\n\n" +
                    "      研发后台采用自主学习,自由学习,积极交流" +
                    "的模式,组员各有所长。后台组鼓励组员拓宽学" +
                    "习范围,均衡发展。组内经常举行内部交流,定期" +
                    "举行内部活动,从而提升技术,增进彼此感情.\n\n" +
                    "      如果你具备基本的C语言基础、对Java编程感" +
                    "兴趣,具有满腔的学习热情,出色的学习能力以" +
                    "及良好的团队协作精神,想学习数据库和服务" +
                    "器,想成为一个幕后操作者,那么研发后台组是" +
                    "你的不二选择。",


            "      Web前端开发组基于HTML/CSS/" +
                    "JavaScript前端语言进行开发,专注于呈现良好" +
                    "的网站界面和网页交互,提供给用户更好的视觉" +
                    "冲击和用户体验,是当前就业面最广的方向。\n\n" +
                    "      组内定期开展技术分享会,与此同时,一些已" +
                    "经进入阿里、腾讯实习工作的师兄师姐也会经常" +
                    "与我们进行经验交流和指导。\n\n" +
                    "      在技术实力雄厚的同时,最重要的一点是,我" +
                    "们有最和谐的性别比例和不能更融洽的相处气" +
                    "氛,宇宙工大之下,可谓出淤泥而不染,实属难" +
                    "得.\n\n" +
                    "      我们需要:基本的C语言理解,0或0以上的前" +
                    "端基础,不止的学习热忱,出色的学习能力,良好" +
                    "的全局把控力,还有最重要的一点是,细腻。\n\n" +
                    "      当然,如果你有良好的审美或是一定的PS基" +
                    "础,那面试时可能会获得一定印象分哦~\n\n" +
                    "      假如你曾想过给自己写一个符合自己所有想象" +
                    "的个人主页;假如你曾想过在一个特殊的日子里" +
                    "用网页的形式给喜欢的人送上一份特殊的礼物" +
                    "又或者你曾想过会有一个网页,当你打开的时" +
                    "候,里面用着你最喜欢的表达方式,写满了你的" +
                    "全部故事。\n\n" +
                    "      那就来我们这试一试。是的,研发前端组,一" +
                    "个情怀和实力兼具的队伍。\n\n" +
                    "      如果你是一个充满想象的人,过来拥抱我们。",


            "      Android开发组专注基于Java语言的主流" +
                    "app开发与 Android技术的钻研。\n\n" +
                    "      我们采用自由高效的管理模式、自由的时间安" +
                    "排,定期举行技术分享会与师兄经验交流会等。\n\n" +
                    "      我们拥有融洽的技术氛围,遇到技术难题,随时提" +
                    "问,一起探讨解决方法;培养友好的内部关系,消" +
                    "除年级隔阂,和谐相处。\n\n" +
                    "      研发 Android组有着一群志同道合的朋友,跟" +
                    "你一起探索 Android的神秘王国,深入学习Java" +
                    "和 Android。除了项目之外,倘若你还有其他新颖" +
                    "可行的想法,还能开发出各种炫酷的App或是小" +
                    "游戏给大家使用。\n\n" +
                    "      假如你热爱技术、热爱 Android,拥有扎实的C" +
                    "语言基础(有Java或 Android基础更佳),善于自" +
                    "主钻研,有责任感并有良好的团队合作精神,那" +
                    "么,你正是我们苦苦寻找的小伙伴!\n\n" +
                    "      加入我们吧," +
                    "不仅能感受浓厚的学习氛围、还能积累项目经" +
                    "验、更有可能获得师兄的内推机会哟~",


            "      研发中心大数据组致力于挖掘数据、分析数据。" +
                    "既专注于基础，又落实于项目；既沉浸于原理，又回归到兴趣。大数据组是研发中心最年轻的小组，" +
                    "但我们拥有更多的可能去开拓、去创造无限的可能。\n" +
                    "\n" +
                    "      研发大数据组采取自由学习，" +
                    "定期交流的模式。我们鼓励大家向自己感兴趣的方向大胆的探索，同时通过小组交流，" +
                    "一方面督促组员不断学习，另一方面组员之间互相汲取经验，在各自的空间中充分发挥。\n\n" +
                    "      因为年轻，所以无限可能，只要你愿意为你的梦想付出努力，研发定为你的破浪前行而喝彩。\n" +
                    "\n" +
                    "      如果你对人工智能充满了向往，对深度学习充满兴趣，无惧抽象的数学，" +
                    "志在拥抱最前沿的技术；如果你善于自主钻研，有责任感，以及良好的团队合作精神和分享精神；" +
                    "如果你厌倦平凡机械的生活，享受对未知的探索与前行；请大胆的选择我们大数据组，丰富的资源，" +
                    "和谐的氛围，只为让你成为研发新的闪亮点！\n"
    };

}
